#include <iostream>
using namespace std;

int main()
{
    //1.Оголосити одновимірний масив з 10 елементів типу int.
    //Заповнити його значеннями з клавіатури, вивести на екран та
    //підрахувати добуток елементів масиву
	const int size = 10;






    //2.Оголосити одновимірний масив з 7 елементів типу int.
    //Заповнити його випадковими значеннями в діапазоні[-12.. + 50]
    //та вивести на екран.
    //Підрахувати кількість відємних та додатніх елементів масиву.






    //3.Оголосити, проініціалізувати початковими значеннями та вивести
    //одновимірний масив з 7 елементів типу long.
    //Визначити суму парних елементів масиву






    //4.Утворити одновимірний масив розміром 10. ///for = 1 2 3 ....10
    //Заповнити його числами, які є степенями 2: (2,4,8,16,32,....)
    //Вивести елементи масиву на екран у прямому і оберненому порядку.






    //5.Дано одновимірний масив.Замінити всі від’ємні елементи їх модулями.
    //if (arr[i]< 0) arr[i]= arr[i]*-1;
    




























}