#include <iostream>
#include <iomanip>
#include <clocale>
using namespace std;

int main()
{
    int a, b, max, min;
    srand(time(0));
    setlocale(LC_ALL, "Ukrainian");

    // 1. Дано масив розміром 4×3 з елементами цілого типу. 
    // Визначити кількість елементів відмінних від нуля. (0-5)
    // 2. Дано масив розміром 3×3 з елементами цілого типу.
    // Визначити кількість елементів які б дорівнювали нулю.
    /*
	const int rows1 = 4, cols1 = 3;
	int arr1[rows1][cols1];
    a = 0, b = 0;
    for (int i = 0; i < rows1; i++)
    {
        for (int j = 0; j < cols1; j++)
        {
            arr1[i][j] = rand() % 5;
            cout << arr1[i][j] << " ";
            if (arr1[i][j] != 0) a++;
            else b++;
        }
		cout << endl;
    }
    cout << "Zero: "<< b << endl;
    cout << "Not zero: "<< a << endl;
    */

    // 3. Дано масив розміром 7×3 з елементами цілого типу.
    // Визначити кількість елементів, модуль яких менший 12. (-20 + rand() % 40)
    /*
    const int rows2 = 7, cols2 = 3;
    int arr2[cols2][rows2];
    a = 0;
    for (int i = 0; i < cols2; i++)
    {
        for (int j = 0; j < rows2; j++)
        {
            arr2[i][j] = -20 + rand() % 40;
            cout << left << setw(6) << arr2[i][j] <<"|";
            if (arr2[i][j] < 0) arr2[i][j] = arr2[i][j] * -1;
			if (arr2[i][j] < 12) a++;
        }
        cout << endl;
    }
    cout << "====================#" << endl << a << endl;
    */

    // 4. Дано масив розміром 4×5 з елементами цілого типу(позитивні та від’ємні).
    // Визначити кількість позитивних елементів.
    /*
    */




    // 5. Дано масив розміром 5×4 з елементами дійсного типу(додатні та від’ємні).
    // Визначити добуток всіх додатніх елементів.
    /*
    */




    // 6. Дано масив розміром 5×4 з елементами дійсного типу(позитивні та від’ємні).
    // Визначити добуток всіх від’ємних елементів.
    /*
    */




    // 7. Дано масив розміром 4×4 з елементами цілого типу.Визначити кількість
    // елементів, які б при діленні на 6 давали залишок 1. 13 % 6 = 1
    /*
    */




    // 8. Дано масив розміром 5хб цілого типу.Знайти мінімальний елемент.
    // 9. Дано масив розміром 5×6 цілого типу.Знайти максимальний елемент.
    /*
    */




    // 10. Дано масив розміром 5×4 з елементами дійсного типу(позитивні та від’ємні).
    // Визначити суму всіх від’ємних елементів.
    /*
    */




}
