#include <iostream>
using namespace std;

int main()
{
    // 1.Вивести на екран цілі числа від 14 до 123. - while
    int temp, count, N, dob, sum;
    double aref;
    /*
    temp = 14;
    while (temp <= 123) {
        cout << temp << " ";
        temp++;
    }
    */

    // 2.Вивести на екран додатні непарні числа, які не перевищують 100. - while
    /*
    temp = 1;
    while (temp <= 100) {
        if (temp % 2 != 0) {
            cout << temp << " ";
        }
        temp++;
    }
    */

    // 3.Дано N (N>0). Вводяться N чисел. Знайти кількість від’ємних серед них. - while
    /*
    N = 6;
    count = 0;
    while (N > 0) {
        cout << "Enter num: "; cin >> temp;
        if (temp < 0) {
            count++;
        }
        N--;
    }
    cout << "Negative nums: " << count << endl;
    */

    // 4.Вводяться 8 чисел. Знайти добуток та середнє арифметичне цих чисел. - while
    /*
    N = 8;
    dob = 1;
    sum = 0;
    while (N > 0) {
        cout << "Enter num: "; cin >> temp;
        dob *= temp;
        sum += temp;
        N--;
    }
    aref = (double)sum / 8;
    cout << "Dobutok: " << dob << endl;
    cout << "Arefmetychne: " << aref << endl;
    */

    // 5.Вивести на екран цілі непарні числа : 100 98 96 94...4  2 1. - do..while
    /*
    N = 100;
    do
    {
        if (N % 2 != 0) {
            cout << N << " ";
        }
        N--;

    } while (N > 1);
    */

    // 6.Написати програму яка обчислює добуток п’яти чисел, які вводяться з клавіатури. - do..while
    /*
    N = 5;
    dob = 1;
    do
    {
        cout << "Enter num: "; cin >> temp;
        dob *= temp;
        N--;
    } while (N > 0);
    cout << "Dob 5 nums: " << dob << endl;
    */


    // На +12 балів :
    // 7.Напишіть програму знаходження суми чисел менше 50 і кратних 4, 
    // використовуючи всі два типи циклів.
    /*
    sum = 0;
    N = 50;
    while (N > 0) {
        if (N % 4 == 0) {
            sum += N;
        }
        N--;
    }
    cout << "Sum: " << sum << endl;
    */

    /*
    sum = 0;
    for (int i = 0; i < 50; i++)
    {
        if (i % 4 == 0) {
            sum += i;
        }
    }
    cout << "Sum: " << sum << endl;
    */

    // 8. Вивести на екран усі числа від нуля до вве-
    // деного користувачем числа.
    






    // 9. Користувач вводить дві межі діапазону, ви-
    // вести на екран усі числа з цього діапазону. Передбачити,
    // щоб користувач міг вводити межі діапазону в довільному
    // порядку.
    // ■ вивести всі парні числа з діапазону.
    // ■ вивести всі непарні числа з діапазону.
    // ■ вивести всі числа, кратні семи.



    // 10. Користувач вводить дві межі діапазону. По-
    // рахувати суму всіх чисел діапазону.



    // 11. Користувач з клавіатури вводить числа. По-
    // рахувати їхню суму і вивести на екран, щойно користувач
    // введе нуль.

    
}
