#include <iostream>
using namespace std;

int main()
{
	int n;
	// 1.Вивести на екран n одиниць, потім 2n двійок, потім 3n трійок.Число n вводить користувач.
	/*
	*/
	cout << "Enter number: "; cin >> n;
	for (int i = 1; i <= n; i++)
	{
		for (int j = 0; j < n*i; j++)
		{
			cout << i << " ";
		}
		cout << endl;
	}

	// 2..Виведіть на екран квадрат з нулів і одиниць, причому нулі знаходяться тільки на діагоналі квадрата.Всього в квадраті сто цифр.
	/*
	n = 10;
	for (int i = 0; i < n; i++)
	{
		for (int j = 0; j < n; j++)
		{
			if (i == j)
			{
				cout << "0 ";
			}
			else
			{
				cout << "1 ";
			}
		}
		cout << endl;
	}
	*/

	// 3.Вивести ряд чисел : десять десяток, дев'ять дев'яток, вісім вісімок, ..., одну одиницю.Знайти суму всіх цих чисел.
	/*
	n = 0;
	for (int i = 10; i > 0; i--)
	{
		for (int j = 0; j < i; j++)
		{
			cout << i << " ";
			n += i;
		}
		cout << endl;
	}
	cout << "Sum: " << n << endl;
	*/

	// 4.Вивести на екран 15 рядків.У рядках з парними номерами вивести по 8 чисел, рівних номеру рядка.У рядках з непарними номерами вивести десять одиниць.
	/*
	for (int i = 1; i <= 15; i++)
	{
		if (i % 2 == 0)
		{
			for (int j = 0; j < 10; j++)
			{
				cout << "1 ";
			}
		}
		else
		{
			for (int j = 0; j < 8; j++)
			{
				cout << i << " ";
			}
		}
		cout << endl;
	}
	*/

	// 5. Вивести 30 рядків.Непарні рядки містять натуральні числа від 1 до номера поточного рядка включно з кроком 1, парні рядки складаються з п'яти одиниць.
	/*
	for (int i = 1; i <= 30; i++)
	{
		if (i % 2 == 0)
		{
			for (int j = 0; j < 5; j++)
			{
				cout << "1 ";
			}
		}
		else
		{
			for (int j = 1; j <= i; j++)
			{
				cout << j << " ";
			}
		}
		cout << endl;
	}
	*/

	// 6.Виведіть на екран таблицю множення для чисел від 1 до 10.
	/*
	for (int i = 1; i <= 10; i++)
	{
		for (int j = 1; j <= 10; j++)
		{
			cout << i << " * " << j << " = " << i*j << endl;
		}
		cout << endl;
	}
	*/

	// 7.Знайдіть кількість цілих чисел від a до b включно, які діляться на 12.
	/*
	n = 0;
	for (int i = 1; i <= 100; i++)
	{
		if (i % 12 == 0)
		{
			cout << i << " ";
			n++;
		}
	}
	cout << endl << "count /12: " << n << endl;
	*/

}
